[
  {
    "title": "Building My Cloud Resume Challenge",
    "handle": "building-cloud-resume",
    "date": "2024-11-15",
    "author": "Boris Atud",
    "tags": [
      "cloud",
      "aws",
      "resume",
      "web development"
    ],
    "excerpt": "My journey through the Cloud Resume Challenge and the lessons I learned along the way.",
    "body_html": "<h1>Building My Cloud Resume Challenge</h1>\n<h2>Introduction</h2>\n<p>When I first heard about the Cloud Resume Challenge, I knew it was the perfect project to showcase my cloud skills and web development abilities. This post chronicles my journey from concept to deployment.</p>\n<h2>The Challenge</h2>\n<p>The Cloud Resume Challenge is a multi-step project designed to help you build practical cloud skills. It involves:</p>\n<ul>\n<li>Creating a resume website hosted on cloud infrastructure</li>\n<li>Implementing serverless backend functionality</li>\n<li>Setting up CI/CD pipelines</li>\n<li>Working with Infrastructure as Code</li>\n</ul>\n<h2>My Approach</h2>\n<p>I decided to use a modern tech stack that would demonstrate both my frontend and backend capabilities:</p>\n<h3>Frontend</h3>\n<ul>\n<li><strong>React</strong> for the UI framework</li>\n<li><strong>Vite</strong> for fast development and building</li>\n<li><strong>CSS</strong> for styling with a focus on responsive design</li>\n</ul>\n<h3>Backend</h3>\n<ul>\n<li><strong>Python</strong> for serverless functions</li>\n<li><strong>JSON</strong> for data storage (later migrated to markdown with frontmatter)</li>\n</ul>\n<h2>Key Learnings</h2>\n<p>Throughout this project, I learned several valuable lessons:</p>\n<ol>\n<li>\n<p><strong>Infrastructure as Code is powerful</strong>: Being able to version control your infrastructure alongside your application code is a game-changer.</p>\n</li>\n<li>\n<p><strong>Serverless has its place</strong>: For certain workloads, serverless functions provide excellent scalability without the overhead of managing servers.</p>\n</li>\n<li>\n<p><strong>Documentation matters</strong>: Writing good documentation as you build helps future you and anyone else who looks at your code.</p>\n</li>\n</ol>\n<h2>Challenges Faced</h2>\n<p>Not everything went smoothly. Here are some obstacles I encountered:</p>\n<ul>\n<li><strong>CORS issues</strong>: Getting the frontend to communicate properly with the backend required careful configuration.</li>\n<li><strong>State management</strong>: Deciding how to structure data and manage application state took careful planning.</li>\n<li><strong>Performance optimization</strong>: Ensuring fast load times required optimization of assets and code splitting.</li>\n</ul>\n<h2>What's Next</h2>\n<p>This project is never truly \"done.\" I have several enhancements planned:</p>\n<ul>\n<li>Adding a blog section (currently in progress!)</li>\n<li>Implementing analytics to track visitors</li>\n<li>Adding more interactive elements</li>\n<li>Improving accessibility</li>\n</ul>\n<h2>Conclusion</h2>\n<p>The Cloud Resume Challenge has been an incredible learning experience. It's given me hands-on experience with cloud technologies and modern web development practices. I highly recommend it to anyone looking to level up their skills.</p>\n<p>If you're interested in seeing the code, check out my <a href=\"https://github.com/yourusername/cloud-resume-challenge\">GitHub repository</a>.</p>"
  },
  {
    "title": "Migrating from JSON to Markdown with Frontmatter",
    "handle": "markdown-with-frontmatter",
    "date": "2024-12-03",
    "author": "Boris Atud",
    "tags": [
      "architecture",
      "refactoring",
      "markdown",
      "best practices"
    ],
    "excerpt": "Why I decided to migrate my project data from a single JSON file to individual markdown files with frontmatter, and how it improved my workflow.",
    "body_html": "<h1>Migrating from JSON to Markdown with Frontmatter</h1>\n<h2>The Problem</h2>\n<p>When I first built my portfolio site, I stored all my project data in a single JSON file. At the time, it seemed like the simplest solution:</p>\n<p><code>json\n[\n  {\n    \"title\": \"Project Name\",\n    \"description\": \"Project description...\",\n    \"body\": \"## Overview\\n\\nProject details...\"\n  }\n]</code></p>\n<p>This worked fine initially, but as my project grew, I started noticing some issues.</p>\n<h2>Why Change?</h2>\n<h3>1. <strong>Poor Developer Experience</strong></h3>\n<p>Writing markdown inside JSON strings is painful. You have to:</p>\n<ul>\n<li>Escape special characters</li>\n<li>Use <code>\\n</code> for line breaks</li>\n<li>Lose syntax highlighting</li>\n<li>Deal with formatting issues</li>\n</ul>\n<h3>2. <strong>Version Control Noise</strong></h3>\n<p>Every time I updated a single project, the entire JSON file would show as changed in git diffs, making it hard to review what actually changed.</p>\n<h3>3. <strong>Limited Flexibility</strong></h3>\n<p>JSON doesn't support comments, and adding metadata required careful structuring. There was no natural way to separate metadata from content.</p>\n<h3>4. <strong>Scalability Concerns</strong></h3>\n<p>As I added more projects, the single JSON file would become increasingly unwieldy to manage and maintain.</p>\n<h2>The Solution: Markdown with Frontmatter</h2>\n<p>I decided to migrate to individual markdown files with YAML frontmatter. Here's what a project file looks like now:</p>\n<h2>```markdown</h2>\n<p>title: \"Project Name\"\nhandle: \"project-slug\"\nthumbnail: \"https://example.com/image.jpg\"\ndescription: \"Short description\"</p>\n<hr />\n<h2>Overview</h2>\n<p>Project details written in natural markdown...\n```</p>\n<h2>Benefits of This Approach</h2>\n<h3>Better Writing Experience</h3>\n<p>Now I can write project descriptions in my favorite markdown editor with full syntax highlighting and preview support.</p>\n<h3>Cleaner Version Control</h3>\n<p>Each project is its own file, so git diffs show exactly what changed. Reviewing changes is much easier.</p>\n<h3>Flexible Metadata</h3>\n<p>YAML frontmatter is easy to read and write. Adding new metadata fields is straightforward, and I can even include comments.</p>\n<h3>Content Management</h3>\n<p>This structure naturally supports content management workflows. I could even use a CMS that works with markdown files if needed.</p>\n<h3>Future-Proof</h3>\n<p>Markdown is a universal format that will be readable for years to come. It's also easily portable to other systems.</p>\n<h2>Implementation Details</h2>\n<p>The migration process involved:</p>\n<ol>\n<li>\n<p><strong>Creating the directory structure</strong>: Set up <code>backend/data/projects/</code> and <code>backend/data/blog/</code></p>\n</li>\n<li>\n<p><strong>Splitting the data</strong>: Each project became its own <code>.md</code> file named after its handle</p>\n</li>\n<li>\n<p><strong>Converting the format</strong>: Moved JSON properties to YAML frontmatter and converted escaped markdown to natural markdown</p>\n</li>\n<li>\n<p><strong>Updating the build process</strong>: Modified the backend to parse markdown files instead of JSON</p>\n</li>\n</ol>\n<h2>Code Changes</h2>\n<p>I needed to update my backend to parse these markdown files. Using Python's <code>python-frontmatter</code> library made this straightforward:</p>\n<p>```python\nimport frontmatter\nimport os</p>\n<p>def load_projects():\n    projects = []\n    project_dir = 'data/projects'</p>\n<pre><code>for filename in os.listdir(project_dir):\n    if filename.endswith('.md'):\n        with open(os.path.join(project_dir, filename), 'r') as f:\n            post = frontmatter.load(f)\n            project = {\n                **post.metadata,\n                'body': post.content\n            }\n            projects.append(project)\n\nreturn projects\n</code></pre>\n<p>```</p>\n<h2>Lessons Learned</h2>\n<ol>\n<li>\n<p><strong>Start with the right structure</strong>: If I had thought about content management from the beginning, I might have chosen markdown from the start.</p>\n</li>\n<li>\n<p><strong>Refactoring is worth it</strong>: Even though the old system \"worked,\" the improved developer experience was worth the migration effort.</p>\n</li>\n<li>\n<p><strong>Use the right tool for the job</strong>: JSON is great for data, but markdown is better for content.</p>\n</li>\n</ol>\n<h2>Conclusion</h2>\n<p>This migration significantly improved my workflow and made the project easier to maintain. If you're building a similar project, I'd strongly recommend using markdown with frontmatter from the start.</p>\n<p>The combination of structured metadata (frontmatter) and natural content formatting (markdown) provides the best of both worlds.</p>\n<p>Have you done a similar migration? I'd love to hear about your experience!</p>"
  }
]